artillery/scenarios/checks/commit_check.yml
config:
  http:
    pool: 2

  defaults:
    headers:
      PRIVATE-TOKEN: "{{ $processEnvironment.ACCESS_TOKEN }}"
      Accept: "application/json"

  phases:
    - duration: 1
      arrivalRate: 1
      name: "Check"

scenarios:
  - flow:
      - get:
          url: /api/v4/projects
          expect:
            - statusCode: 200